In [1]:
# CREATING A DATA FRAME

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [4]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [5]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

In [9]:
df2 = pd.DataFrame(data_list)
df2

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [11]:
columns = ["name", "age", "city", "salary"]
df2 = pd.DataFrame(data_list, columns= columns)
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [12]:
# SELECTING AND INDEXING OF THE COLUMNS

In [13]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
# SELECTING NAME AND CITY
df2[["name", "city"]]

    name      city
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [16]:
# SELECTING SALARY
df2["salary"]

0    65000
1    70000
2    62000
3    85000
Name: salary, dtype: int64

In [23]:
# CREATING A NEW COLUMN
df2["designation"] = ["Doctor", "Scientist", "Lawyer", "Graphic Designer"]

In [24]:
df2

    name  age      city  salary       designation
0   John   28  New York   65000            Doctor
1   Anna   34     Paris   70000         Scientist
2  Peter   29    Berlin   62000            Lawyer
3  Linda   42    London   85000  Graphic Designer

In [25]:
# REMOVING COLUMNS
df2.drop(["designation"], axis= 1, inplace= True) # inplace = True --> Removing the col permenantly
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [26]:
# REMOVING ROWS
df2.drop(3, axis= 0)

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000

In [29]:
# SELECTING OF ROWS USING loc() FUNCTION
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [33]:
df2.loc[[0, 1]] # USING LIST OF LIST TO SELECT THE ROWS

   name  age      city  salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [35]:
df.iloc[[2, 3]]

    Name  Age    City  Salary
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [37]:
# SELECTING SUBSETS OF ROWS AND COLS
df2.loc[[0, 1]][["city", "salary"]]

       city  salary
0  New York   65000
1     Paris   70000

In [38]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [39]:
df2.loc[[2, 3]][["name", "age"]]

    name  age
2  Peter   29
3  Linda   42

In [40]:
# CONDITIONAL SELECTION

In [41]:
df2

    name  age      city  salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [42]:
# SELECTING OF PEOPLE WHOSE AGE IS GREATER THAN 30
df2[df2["age"] > 30]

    name  age    city  salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [43]:
# SELECTING OF PEOPLE WHOSE AGE IS GREATER THAN 30 AND ONLY LIVE IN PARIS
df2[(df2["age"] > 30) & (df2["city"] == "paris")]

Empty DataFrame
Columns: [name, age, city, salary]
Index: []

In [47]:
df2[(df2["age"] > 30) & (df2["city"] == 'Paris')] # USING & OPERATOR

   name  age   city  salary
1  Anna   34  Paris   70000